Revit 2025 API
StructuralConnectionApplyTo Enumeration
 An enumerated type that represents the type of structural locations to which a connection annotation may be applied.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StructuralConnectionApplyTo
Public Enumeration StructuralConnectionApplyTo
public enum class StructuralConnectionApplyTo
type StructuralConnectionApplyTo
Members
Member name | Value | Description
BeamsAndBraces | 0 |  Designate a StructuralConnectionType to apply to beams and braces.
ColumnTop | 1 |  Designate a StructuralConnectionType to apply to the top of a column.
ColumnBase | 2 |  Designate a StructuralConnectionType to apply to the base of a column.
Connection | 3 |  Designate a StructuralConnectionType to apply to the Connection Handler.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace